# Реализуйте генераторную функцию dates(), которая принимает два аргумента в следующем порядке:
#     start — дата, тип date
#     count — натуральное число, по умолчанию имеет значение None
# Если count имеет значение None, функция должна возвращать генератор, порождающий последовательность из максимально допустимого количества дат (тип date), начиная с даты start.
# Если count имеет в качестве значения натуральное число, функция должна возвращать генератор, порождающий последовательность из count дат (тип date), начиная с даты start, а затем возбуждающий исключение StopIteration.
# Примечание 1. В тестирующую систему сдайте программу, содержащую только необходимую генераторную функцию dates(), но не код, вызывающий ее.

from datetime import *

def dates(start: datetime, count: int = None, n = 0):
    try:
        while n != count:
            yield start + timedelta(n)
            n += 1
    except:
        return
