# Дима очень хочет поесть, но денег у него мало. Помогите ему определить самый дешевый продукт, а также магазин, в котором он продается.
# Вам доступен файл prices.csv, который содержит информацию о ценах продуктов в различных магазинах.
# В первом столбце записано название магазина, а в последующих — цена на соответствующий товар в этом магазине:
# Магазин;Творог;Гречка;Рис;Бородинский хлеб;Яблоки;Пельмени;Овсяное печенье;Спагетти;Печеная фасоль;Мороженое;Фарш;Вареники;Картофель;Батончик
# Пятерочка;69;133;129;83;141;90;72;123;149;89;88;106;54;84
# Магнит;102;87;95;75;109;112;97;82;101;134;69;61;141;79
# ...
# Напишите программу, которая определяет и выводит самый дешевый продукт и название магазина, в котором он продается, в следующем формате:
# <название продукта>: <название магазина>
# Если имеется несколько самых дешевых товаров, то следует вывести тот товар, чье название меньше в лексикографическом сравнении.
# Если один товар продается в нескольких магазинах по одной минимальной цене, то следует вывести тот магазин, чье название меньше в лексикографическом сравнении.
# Примечание 1. Разделителем в файле prices.csv является точка с запятой, при этом кавычки не используются.
# Примечание 2. Указанный файл доступен по ссылке. Ответ на задачу доступен по ссылке.
# Примечание 3. Пример вывода:
# Клубничный йогурт: ВкусВилл
# Примечание 4. При открытии файла используйте явное указание кодировки UTF-8.

import csv

mydict = {}
with open('prices.csv', encoding='utf-8') as file:
    dat = list(csv.reader(file, delimiter=';'))
    d = dat[0][1:]
    for i in dat[1:]:
        for j  in range(len(i)-1):
            mydict.setdefault(i[0], []).append((d[j], i[j+1]))
    for k, v  in mydict.items():
        mydict[k] = min(v, key=lambda x: (int(x[1]), x[0]))
    dat_min = min((int(v[1]), v[0], k) for k, v in mydict.items())
    print(f'{dat_min[1]}: {dat_min[2]}')




