# Тимур живет в мире, в котором цена товара определяется как сумма Unicode кодов букв его названия.
# Буквенным обозначением данной валюты являются две заглавные латинские буквы UC.
# Например, ручка в его мире стоит:
# 1088+1091+1095+1082+1072=5428  UC
# 1088+1091+1095+1082+1072=5428UCТимур составляет список покупок, но так как на его клавиатуре перестал работать блок с цифрами, то вместо указания количества товара числом, он добавляет его в список столько раз, сколько планирует купить.
# Все товары Тимур записывает в нижнем регистре через запятую.
# Напишите программу, которая группирует одинаковые товары из данного списка покупок и определяет стоимость каждой группы.
# Формат входных данных
# На вход программе подается последовательность товаров, разделенных запятой без пробелов.
# Формат выходных данных
# Программа должна сгруппировать одинаковые товары, определить общую стоимость каждой группы и вывести полученный результат.
# Товары должны быть расположены в лексикографическом порядке, каждый на отдельной строке, в следующем формате:
# <товар>: <цена за единицу товара> UC x <количество товаров в группе> = <общая стоимость группы> UC
# Примечание 1. Программа должна добавлять нужное количество пробелов, если название товара имеет меньшую длину, чем другие.
# Примечание 2. Получить Unicode код символа можно с помощью функции ord().

from collections import Counter
from functools import reduce

text = input().split(',')
dat = Counter(text)
for k, v in sorted(dat.items()):
    i = reduce(lambda x, y: ord(y) + x, k.replace(" ", ""), 0)
    print(f'{k.ljust(len(max(text, key=len)))}: {i} UC x {v} = {i*v} UC')