# Реализуйте декоратор repeat, который принимает один аргумент:
#     times — натуральное число
# Декоратор должен вызывать декорируемую функцию times раз.
# Также декоратор должен сохранять имя и строку документации декорируемой функции.
# Примечание 1. Не забывайте про то, что декоратор не должен поглощать возвращаемое значение декорируемой функции, а также должен уметь декорировать функции с произвольным количеством позиционных и именованных аргументов.
# Примечание 2. В тестирующую систему сдайте программу, содержащую только необходимый декоратор repeat, но не код, вызывающий его.

import functools

def repeat(times=1):
    def repeat_decorator(func):
        @functools.wraps(func)
        def wrapper(*args, **kwargs):
            for i in range(times):
                value = func(*args, **kwargs)
            return value    
        return wrapper    
    return repeat_decorator 