# Реализуйте декоратор ignore_exception, который принимает произвольное количество позиционных аргументов — типов исключений, и выводит текст:
# Исключение <тип исключения> обработано
# если во время выполнения декорируемой функции было возбуждено исключение, принадлежащее одному из переданных типов.
# Если возбужденное исключение не принадлежит ни одному из переданных типов, оно должно быть возбуждено снова.
# Также декоратор должен сохранять имя и строку документации декорируемой функции.
# Примечание 1. Не забывайте про то, что декоратор не должен поглощать возвращаемое значение декорируемой функции, а также должен уметь декорировать функции с произвольным количеством позиционных и именованных аргументов.
# Примечание 2. В тестирующую систему сдайте программу, содержащую только необходимый декоратор ignore_exception, но не код, вызывающий его.

import functools

def ignore_exception(*excepts: tuple) -> callable:
    def ignore_exception_decorater(func: callable) -> callable:
        @functools.wraps(func)
        def wrapper(*args, **kwargs):
            """Декоратор обработки исключений"""
            try:
                return func(*args,**kwargs)
            except excepts as err:
                print (f'Исключение {type(err).__name__} обработано')
        return wrapper    
    return ignore_exception_decorater