# Реализуйте декоратор returns, который принимает один аргумент:
#     datatype — тип данных
# Декоратор должен проверять, что возвращаемое значение декорируемой функции принадлежит типу datatype. Если возвращаемое значение принадлежит какому-либо другому типу, декоратор должен возбуждать исключение TypeError.
# Также декоратор должен сохранять имя и строку документации декорируемой функции.
# Примечание 1. Не забывайте про то, что декоратор не должен поглощать возвращаемое значение декорируемой функции, а также должен уметь декорировать функции с произвольным количеством позиционных и именованных аргументов.
# Примечание 2. В тестирующую систему сдайте программу, содержащую только необходимый декоратор returns, но не код, вызывающий его.

import functools

def returns(datatype):
    def returns_decorator(func):
        @functools.wraps(func)
        def wrapper(*args, **kwargs):
            values = func(*args, **kwargs)
            if not isinstance(values, datatype):
                raise TypeError
            else:
                return values
        return wrapper
    return returns_decorator