# Реализуйте декоратор retry, который принимает один аргумент:
#     times — натуральное число
# Декоратор должен выполнять повторную попытку вызова декорируемой функции, если во время ее выполнения возникает ошибка. Декоратор должен вызывать ее до тех пор, пока не исчерпает количество попыток times, после чего должен возбуждать исключение MaxRetriesException.
# Также декоратор должен сохранять имя и строку документации декорируемой функции.
# Примечание 1. Не забывайте про то, что декоратор не должен поглощать возвращаемое значение декорируемой функции, а также должен уметь декорировать функции с произвольным количеством позиционных и именованных аргументов. 
# Примечание 2. В тестирующую систему сдайте программу, содержащую только необходимый декоратор retry, но не код, вызывающий его. 

class MaxRetriesException(Exception):
    pass

import functools

def retry(times: int) -> callable:
    def retry_decorater(func: callable) -> callable:
        @functools.wraps(func)
        def wrapper(*args, **kwargs):
            """Декоратор обработки исключений"""
            for _ in range(times):
                try:
                    return func(*args,**kwargs)
                except:
                    pass
            else:
                raise MaxRetriesException
        return wrapper    
    return retry_decorater